Hello @ian-r-rose,

Please refer to the production plan below. Some of the changes were applied as part of the initial deployment (when we started encountering issues). Hence, it shows that a few resources will be destroyed.

I have pushed the new changes into the branch. I know you approved that PR, but I have not merged it yet, as I would like you to look at the final code. All these changes have been applied to development environment.


----------------------- Production plan ------


Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  **module.elt.snowflake_account_role.streamlit_access_role will be created**
  + resource "snowflake_account_role" "streamlit_access_role" {
      + comment              = "Role to grant Streamlit creation privileges"
      + fully_qualified_name = (known after apply)
      + id                   = (known after apply)
      + name                 = "ANALYTICS_PRD_STREAMLIT_ACCESS"
      + show_output          = (known after apply)
    }

   **module.elt.snowflake_account_role.streamlit_analytics will be destroyed**
   (because snowflake_account_role.streamlit_analytics is not in configuration)
  - resource "snowflake_account_role" "streamlit_analytics" {
      - comment              = "Permissions to create Streamlit applications and stages in the ANALYTICS_PRD database for the PRD environment." -> null
      - fully_qualified_name = "\"ANALYTICS_PRD_STREAMLIT\"" -> null
      - id                   = "ANALYTICS_PRD_STREAMLIT" -> null
      - name                 = "ANALYTICS_PRD_STREAMLIT" -> null
      - show_output          = [
          - {
              - assigned_to_users = 0
              - comment           = "Permissions to create Streamlit applications and stages in the ANALYTICS_PRD database for the PRD environment."
              - created_on        = "2025-05-05 14:59:52.262 -0700 PDT"
              - granted_roles     = 0
              - granted_to_roles  = 1
              - is_current        = false
              - is_default        = false
              - is_inherited      = true
              - name              = "ANALYTICS_PRD_STREAMLIT"
              - owner             = "USERADMIN"
            },
        ] -> null
    }

  **module.elt.snowflake_grant_account_role.streamlit_analytics_to_reporter will be destroyed**
  (because snowflake_grant_account_role.streamlit_analytics_to_reporter is not in configuration)
  - resource "snowflake_grant_account_role" "streamlit_analytics_to_reporter" {
      - id               = "\"ANALYTICS_PRD_STREAMLIT\"|ROLE|\"REPORTER_PRD\"" -> null
      - parent_role_name = "REPORTER_PRD" -> null
      - role_name        = "ANALYTICS_PRD_STREAMLIT" -> null
    }

  **module.elt.snowflake_grant_account_role.streamlit_to_reporter will be created**
  + resource "snowflake_grant_account_role" "streamlit_to_reporter" {
      + id               = (known after apply)
      + parent_role_name = "REPORTER_PRD"
      + role_name        = "ANALYTICS_PRD_STREAMLIT_ACCESS"
    }

  **module.elt.snowflake_grant_privileges_to_account_role.streamlit_future_streamlit_privileges will be created**
  + resource "snowflake_grant_privileges_to_account_role" "streamlit_future_streamlit_privileges" {
      + account_role_name = "ANALYTICS_PRD_STREAMLIT_ACCESS"
      + all_privileges    = false
      + always_apply      = false
      + id                = (known after apply)
      + on_account        = false
      + privileges        = [
          + "CREATE STAGE",
          + "CREATE STREAMLIT",
        ]
      + with_grant_option = false

      + on_schema {
          + future_schemas_in_database = "ANALYTICS_PRD"
        }
    }

  **module.elt.snowflake_grant_privileges_to_account_role.streamlit_public_streamlit_privileges will be created**
  + resource "snowflake_grant_privileges_to_account_role" "streamlit_public_streamlit_privileges" {
      + account_role_name = "ANALYTICS_PRD_STREAMLIT_ACCESS"
      + all_privileges    = false
      + always_apply      = false
      + id                = (known after apply)
      + on_account        = false
      + privileges        = [
          + "CREATE STAGE",
          + "CREATE STREAMLIT",
        ]
      + with_grant_option = false

      + on_schema {
          + schema_name = "ANALYTICS_PRD.PUBLIC"
        }
    }

Plan: 4 to add, 0 to change, 2 to destroy.

-----------------------------------------------------------